Temple-of-Epiphany/anchor-drag-pro/platform/esp32/sdkconfig.defaults
# Anchor Drag Pro - SDK Configuration Defaults
# Target: ESP32-S3-WROOM-1-N16R8 (Waveshare ESP32-S3-Touch-LCD-4.3B)
# Author: Colin Bitterfield
# Email: colin@bitterfield.com
# Date Created: 2025-12-19
# Date Updated: 2025-12-24

# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash size 16MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# PSRAM 8MB Octal @ 120MHz (CRITICAL for RGB LCD performance)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_120M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# CPU frequency 240MHz
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# FreeRTOS tick rate
CONFIG_FREERTOS_HZ=1000

# Flash Configuration - QIO @ 120MHz (CRITICAL for RGB LCD performance)
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_120M=y

# ESP32-S3 Data Cache - 64B cache line (CRITICAL for RGB LCD DMA)
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# Compiler Optimization - Performance mode (CRITICAL for RGB LCD refresh rate)
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# LVGL Performance Settings (CRITICAL for tear-free rendering)
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y

# LVGL fonts — enable the Montserrat sizes used by the wiki UI specs.
# Wiki spec keys text sizes at 14 (small labels), 16 (body), 18 (status
# rows), 22 (modal titles), 32 (splash brand). Adjust here when a new
# size is introduced in a spec; un-enabled sizes are stripped from the
# build to save flash. See Spec-Sync wiki page for the contract.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_32=y

# Custom Partition Table (3MB app partition for large firmware)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Main task stack size (16KB needed for UI initialization)
CONFIG_MAIN_TASK_STACK_SIZE=16384

# OTA with auto-rollback (Phase 2D — Workstream 8)
# New firmware boots in PENDING_VERIFY state. App must call
# esp_ota_mark_app_valid_cancel_rollback() after a self-test;
# otherwise the bootloader reverts to the previous partition.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# FATFS — long filenames + exFAT (Phase 2C/2D)
# Default IDF builds disable LFN, which truncates anchor-drag-pro_v*.bin
# to 8.3 format on the SD card and breaks the OTA filename scanner.
# LFN_STACK uses ~1 KB stack per file-handling task in exchange for
# predictable timing (vs LFN_HEAP which malloc/frees per call).
# exFAT support added so customers can use SD cards >32 GB for
# extended logging — the cost is ~30 KB code, no licensing fees in IDF.
CONFIG_FATFS_LFN_STACK=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_LFN_UNICODE_UTF8=y
CONFIG_FATFS_LFN_UTF8=y
